Repository: BloomBooks/BloomDesktop
Catalog: DistFiles/localization/Bloom.sw.tmx
Source language: sw
Languages: en

source: Hakuna chochote kwenye klipbodi ambacho unaweza kuweka hapa.
en: There is nothing on the Clipboard that you can paste here.

source: Mahali/Nafasi
en: Position

source: Huwezi kuweka chochote pale ndani unapotengeneza kitabu cha kwanza.
en: You cannot put anything in there while making an original book.

source: Kuweka nafasi
en: Spacing

source: Pana kupita kiasi
en: Extra Wide

source: Ongeza au punguza muundo wa mtindo
en: Adjust formatting for style

source: Kurasa za Vigezo
en: Template Pages

source: Picha upande wa Chini
en: Picture On Bottom

source: Habari kuhusu Taaluma ya Kifaa
en: Picture Intellectual Property Information

source: Kifaa cha kusoma kinachoweza Kufasiriwa
en: Decodable Reader Tool

source: Bloom inaweza tu kukubali maneno ya kwanza tu {0}.
en: Bloom can handle only the first {0} words.

source: Majina yanayokubaliwa katika awamu hii
en: Allowed words in this stage

source: Jalada za maandishi
en: Text files

source: Herufi: {0}
en: Letters: {0}

source: Ifuatayo ni ripoti iliyotolewa ya awamu zinazoweza kufasiriwa kwa {0}. Unaweza kufanya mabadiliko yoyote unayotaka kwa faili hii,lakini Bloom Haitatambua mabadiliko yako.Ni ripoti tu.
en: The following is a generated report of the decodable stages for {0}. You can make any changes you want to this file, but Bloom will not notice your changes. It is just a report.

source: Majina Mapya Yanayoweza Kufasiriwa: {0}
en: New Decodable Words: {0}

source: Majina mapya Yanayoonekana: {0}
en: New Sight Words: {0}

source: hatua {0}
en: Stage {0}

source: Kamilisha Orodha ya Majina
en: Complete Word List

source: Herufi katika ukurasa huu
en: Letters in this stage

source: Fungua jalada la Orodha ya Herufi na Maneno
en: Open a Letter and Word List File

source: Anzisha ripoti ya orodha ya herufi na neno
en: Generate a letter and word list report

source: Chukua maneno kutoka kwenye awamu hii
en: Sample words in this stage

source: Panga hatua
en: Set up Stages

source: Hatua
en: Stage

source: ya
en: of

source: Maneno kwenye awamu hii
en: Words in this stage

source: Kifaa cha Kusoma kilichopewa ngazi
en: Leveled Reader Tool

source: Kamili
en: Actual

source: Uwiano kwa kila sentensi
en: avg per sentence

source: Uchaguzi wa Mada
en: Choice of Topic

source: Kwa ngazi hii
en: For this Level

source: Kubadilisha Muundo
en: Formatting

source: Usaidizi wa Maelezo
en: Illustration Support

source: Kumbuka
en: Keep in mind

source: Ngazi
en: Level

source: Idadi ya juu zaidi
en: Max

source: kwa kila ukurasa
en: per page

source: sentensi ndefu zaidi
en: longest sentence

source: Uwezekano wa kutabiriwa
en: Predictability

source: Anzisha ngazi
en: Set up Levels

source: Kitabu Hiki
en: This Book

source: Ukurasa Huu
en: This Page

source: jumla
en: total

source: kipekee
en: unique

source: Msamiati
en: Vocabulary

source: Idadi ya Maneno
en: Word Counts

source: Kubali mabadiliko kwenye kitabu hiki cha sheli
en: Allow changes to this shellbook

source: Bloom kwa kawaida huzuia mabadiliko mengi kwenye vitabu vya sheli. Iwapo utahitaji kuongeza kurasa, kubadlisha picha na kadhalika, weka alama kwenye kisanduku kilicho hapa chini.
en: Bloom normally prevents most changes to shellbooks. If you need to add pages, change images, etc., tick the box below.

source: Kurekodi kwa Bloom kuko katika hali isiyo ya kawaida, ambayo huenda ikawa imesababishwa na kutoa mikrofoni. Utahitajika kuianzisha upya.
en: Bloom recording is in an unusual state, possibly caused by unplugging a microphone. You will need to restart.

source: Hakuna kifaa cha ndani
en: No input device

source: Kompyuta hii inaonekana kutokuwa na kifaa cha kurekodi sauti. Utahitajika kurekodi sauti ya kitabu kilicho na sauti.
en: This computer appears to have no sound recording device available. You will need one to record audio for a talking book.

source: Tafadhali shikilia kitufe ukielekeza upande wa chini hadi umalize kurekodi
en: Please hold the button down until you have finished recording

source: 4) Angalia
en: 4) Check

source: 1) Angalia ili kuhakikisha kuwa unarekodi kwenye kifaa kinachofaa na kuwa ngazi hizi zinaonyesha rangi ya buluu:
en: 1) Check that you are recording into the correct device and that these levels are showing blue:

source: Maliza
en: Clear

source: Kifaa cha Kitabu kilicho na Sauti
en: Talking Book Tool

source: Sikiliza ukurasa wote
en: Listen to the whole page

source: 2) Angalia sentensi iliyosisitizwa
en: 2) Look at the highlighted sentence

source: 5) Inayofuata
en: 5) Next

source: 3) Zungumza
en: 3) Speak

source: Tengeneza kitabu cha mtandao ambacho kinaweza kucheza yaliyorekodiwa unapoweka alama ya kusisitiza kwa sentensi.
en: Make an e-book that can play recordings while highlighting sentences.

source: Seti upya kifaa cha kuvuta picha
en: Reset Zoom

source: Lugha tatu
en: Three Languages

source: Batilisha (Ctrl+Z)
en: Undo (Ctrl+Z)

source: Hakuna chochote cha kubatilisha
en: There is nothing to undo

source: Bloom imekuwa na tatizo katika kuonyesha kitabu hiki. Hii haimaanishi kuwa kazi yako imepotea, lakini inamaanisha kuwa kuna kitu kimepitwa na wakati, kimepotea, au kimeharibika.
en: Bloom had a problem showing this book. This doesn't mean your work is lost, but it does mean that something is out of date, is missing, or has gone wrong.

source: Bloom imekuwa na tatizo katika kuonyesha kitabu hiki. Hii haimaanishi kuwa kazi yako imepotea, lakini inamaanisha kuwa kuna kitu kimepitwa na wakati, kimepotea, au kimeharibika. Kubali kutumia kielelezo cha 'Ripoti Tatizo' kilicho chini ya 'Usaidizi'.
en: Bloom had a problem showing this book. This doesn't mean your work is lost, but it does mean that something is out of date, is missing, or has gone wrong. Consider using the 'Report a Problem' command under the 'Help' menu.

source: Bloom ilishindwa kuanzisha kifaa cha HTTP cha kusikiza ambacho huwa inatumia kuwasiliana na kifaa chake kilichotiwa ndani cha mtandao wa intaneti. Iwapo hii itatendeka hata ingawa ulikuwa tu umefungua upya kompyuta yako, ambia mtu achunguze iwapo una kifaa kinachotumika kwa nguvu ambacho kimewekwa kwenye mtandao. Kifaa hiki kinachotumika kwa nguvu kilicho kwenye mtandao kinaweza kuhitajika kutolewa kabla ya wewe kuweza kutumia Bloom.
en: Bloom was unable to start its own HTTP listener that it uses to talk to its embedded Firefox browser. If this happens even if you just restarted your computer, ask someone to investigate if you have an aggressive firewall product installed. The agressive firewall product may need to be uninstalled before you can use Bloom.

source: Kompyuta yako ilikataza Blook kupata kitabu. Unaweza kuhitaji usaidizi wa kifundi ili kuandaa mfumo wa utenda kazi idhini ya kupata faili hii.
en: Your computer denied Bloom access to the book. You may need technical help in setting the operating system permissions for this file.

source: Kulikuwa na tatizo katika kuchagua kitabu. Kufungua upya Bloom kunaweza kusuluhisha tatizo hili. Iwapo haitawezekana, tafadhali kliki kifute cha 'Maelezo' na uripoti tatizo kwa Wataalamu husika wa Bloom.
en: There was a problem selecting the book. Restarting Bloom may fix the problem. If not, please click the 'Details' button and report the problem to the Bloom Developers.

source: Kulikuwa na tatizo katika kutengeneza upya kitabu. Kufungua upya Bloom kunaweza kusuluhisha tatizo hili. Iwapo haitawezekana, tafadhali kliki kifute cha 'Maelezo' na uripoti tatizo kwa Wataalamu husika wa Bloom.
en: There was a problem updating the book. Restarting Bloom may fix the problem. If not, please click the 'Details' button and report the problem to the Bloom Developers.

source: {0} huhitaji tafsiri mpya zaidi ya Bloom. Toa tafsiti mpya ya Bloom kutoka kwa {1}.
en: {0} requires a newer version of Bloom. Download the latest version of Bloom from {1}.

source: Bloom inapata tatizo katika kufuta picha hii: {0}
en: Bloom had a problem deleting this file: {0}

source: Bloom ilipata tatizo katika kuipokea picha hii
en: Bloom had a problem importing this picture.

source: Ripoti tatizo hili kwa Usaidizi wa
en: Report this problem to Bloom Support

source: Samahani, kuna jambo limeharibika.
en: Sorry, something went wrong.

source: Kitabu hiki kilihitaji seti ya machapisho ya Mbele/Nyuma iitwayo '{0}', lakini Bloom haikuipata kwenye kompyuta hii. Unaweza kuweka Seti ya Bloom itakayokupa '{0}', au uende kwa Mpangilio:Kutengeneza Kitabu na ubadilishe kuwa seti tofauti ya machapisho ya Mbele/Nyuma.
en: This Book called for Front/Back Matter pack named '{0}', but Bloom couldn't find that on this computer. You can either install a Bloom Pack that will give you '{0}', or go to Settings:Book Making and change to another Front/Back Matter Pack.

source: Bloom haiwezi kujifungua inavyofaa, na dalili hii imeonekana kwenye mashine zilizowekwa King'ora cha Eneo. Kumbuka: kuzima King'ora cha Eneo hakusaidii. Wala kufungua upya huku kikiwa kimezimwa. Kitu fulani kuhusu uwekaji wa King'ora cha Eneo husababisha tatizo, na hivyo kukitoa king'ora cha eneo tu kumeonyesha kusuluhisha tatizo.
en: Bloom cannot start properly, and this symptom has been observed on machines with ZoneAlarm installed. Note: disabling ZoneAlarm does not help. Nor does restarting with it turned off. Something about the installation of ZoneAlarm causes the problem, and so far only uninstalling ZoneAlarm has been shown to fix the problem.

source: Kutengeneza Vigezo vya Kusoma
en: Building Reader Templates

source: Tafuta Tafsri Mpya
en: Check For New Version

source: Kuhusu Blooom
en: About Bloom

source: Hifadhi ya hati
en: Documentation

source: Pata Usaidizi
en: Get Help

source: Dhana Kuu za Bloom
en: Key Bloom Concepts

source: Toa Pendekezo
en: Make a Suggestion

source: Usajili
en: Registration

source: Achilia muhtasari...
en: Release Notes...

source: Ripoti Tatizo...
en: Report a Problem...

source: Onyesha sehemu ya tukio
en: Show Event Log

source: Kutumia Vigezo vya Msomaji
en: Using Reader Templates

source: Mfumo wa Kimtandao
en: Web Site

source: Video za Kufundisha
en: Training Videos

source: Sehemu ya Bloom, BloomPdfMaker.exe, inaonekana kupotea. Hii inazuia kuonekana kwa onyesho la awali na uchapishaji. programu ya antivairasi wakati mwingine hufanya hivi. Unaweza kuhitaji usadizi wa kifundi ili kukarabati uwekaji wa Bloom na kuzuia faili hii kufutika tena.
en: A component of Bloom, BloomPdfMaker.exe, seems to be missing. This prevents previews and printing. Antivirus software sometimes does this. You may need technical help to repair the Bloom installation and protect this file from being deleted again.

source: Kubadilisha kuwa mp3
en: Converting to mp3

source: Hati hii imeandikwa kutoka kulia kwenda kushoto
en: This script is right to left

source: Hati hii inahitaji mistari mirefu zaidi
en: This script requires taller lines

source: Aina ya muundo wa A4
en: A4Landscape

source: Muundo wa A4 wa Kila upande
en: A4Landscape SideBySide

source: Muundo wa A4 Hugawanya Katikati ya Kurasa
en: A4Landscape SplitAcrossPages

source: Picha ya A4
en: A4Portrait

source: Muundo wa A5
en: A5Landscape

source: Picha ya A5
en: A5Portrait

source: Mpangilio wa chini wa picha ya A5
en: A5Portrait BottomAlign

source: Muundo wa A6
en: A6Landscape

source: Picha ya A6
en: A6Portrait

source: Picha ya B5
en: B5Portrait

source: PIcha ya Nusu Herufi
en: HalfLetterPortrait

source: Muundo wa Herufi
en: LetterLandscape

source: Picha ya Herufi
en: LetterPortrait

source: Muundo wa Nusu Herufi
en: QuarterLetterLandscape

source: Ninakubali makubaliano ya masharti ya leseni
en: I accept the terms of the license agreement

source: Ninakubaliana na Masharti ya matumizi ya Maktaba ya Bloom
en: I agree to the Bloom Library's Terms of Use

source: Anwani ya Barua pepe
en: Email Address

source: Umesahau neno la siri
en: Forgot Password

source: Ingia kwenye akaunti
en: &Login

source: neno la siri
en: Password

source: onyesha neno la siri
en: &Show Password

source: Onyesha Masharti ya Matumizi
en: Show Terms of Use

source: Ingia kwenye BloomLibrary.org
en: Log in to BloomLibrary.org

source: Tayari kuna mkusanyiko ulio na jina kama hilo, kwenye <a href='file://{0}'>{0}</a>.\nTafadhali chagua jina la kipekee.
en: There is already a collection with that name, at <a href='file://{0}'>{0}</a>.\nPlease pick a unique name.

source: Chagua lugha kuu ya Mkusanyiko huu
en: Choose the Main Language For This Collection

source: Kwa mfano: "Vitabu vya Afya", "PNG Hadithi za Wanyama"
en: Examples: "Health Books", "PNG Animal Stories"

source: Je, ungependa kuupa mkusanyiko huu jina lipi?
en: What would you like to call this collection?

source: Tatizo la Jina la Mkusanyiko
en: Collection Name Problem

source: Mkusanyiko utaanzishwa kwenye: {0}
en: Collection will be created at: {0}

source: Tayari kutengeneza Mkusanyiko Mpya
en: Ready To Create New Collection

source: Fonti na Hati
en: Font and Script

source: Chagua Aina ya Mkusanyiko
en: Choose the Collection Type

source: Iwapo tayari una mkusanyiko ambao ungependa kufungua, kliki kwenye kifute cha 'Batilisha'.
en: If you already have a collection you want to open, click the 'Cancel' button.

source: Mkusanyiko wa chanzo
en: Source Collection

source: Mkusanyiko wa sheli au vitabu vya vigezo katika lugha moja au zaidi za mawasiliano mapana. Utaweza kuziweka sheli hizi kwenye BloomLibrary.org. Pia unaweza kutengeneza Seti ya Bloom kuwapa wengine ili waweze kutengeneza vitabu kwa lugha ya mama kutoka kwa sheli zako.
en: A collection of shell or template books in one or more languages of wider communication. You will be able to upload these shells to BloomLibrary.org. You may also make a Bloom Pack to give to others so that they can make vernacular books with your shells.

source: Mkusanyikko wa Lugha ya mama/Lugha ya eneo
en: Vernacular/Local Language Collection

source: Mkusanyiko wa vitabu katika lugha ya eneo.
en: A collection of books in a local language.

source: Peana Eneo la Lugha
en: Give Language Location

source: Hizi sio za lazimaBloom itaziweka mahali panapofaa kwenye ukurasa wa mada ya vitabu utakavyotengeneza.
en: These are optional. Bloom will place them in the right places on title page of books you create.

source: {0} Vitabu
en: {0} Books

source: Tengeneza Mkusanyiko Mpya wa Bloom
en: Create New Bloom Collection

source: Jina la Mradi
en: Project Name

source: Imeshindwa kutengeneza jina la mkusanyiko.
en: Unable to create a new collection using that name.

source: Karibu kwenye Bloom!
en: Welcome To Bloom!

source: Uko tayari kuanza kutengeneza vitabu.
en: You are almost ready to start making books.

source: Ili kufanya mambo kuwa rahisi na kuwa yenye mpangilio, Bloom huweka vitabu vyote unavyotengeneza kwenye <i>Mkusanyiko</i>mmoja au zaidi. Jambo la kwanza tunalopaswa kufanya ni kukutengenezea moja.
en: In order to keep things simple and organized, Bloom keeps all the books you make in one or more <i>Collections</i>. The first thing we need to do is make one for you.

source: Kliki 'Yanayofuata' ili kuanza.
en: Click 'Next' to get started.

source: Bloom iligundua kuwa mkusanyiko huu uko kwenye folda yako ya dropbox. Hii inaweza kusababisha matatizo kwa kuwa wakati mwingine dropboksi wakati mwingine hufungia Bloom kutoka kwa faili zake. Iwapo una matatizo, tunapendekeza kuwa usongeshe mkusanyiko wako mahali pengine au uizime dropboksi yako utakapokuwa ukitumia Bloom.
en: Bloom detected that this collection is located in your Dropbox folder. This can cause problems as Dropbox sometimes locks Bloom out of its own files. If you have problems, we recommend that you move your collection somewhere else or disable Dropbox while using Bloom.

source: Mkusanyiko huu ni sehemu ya 'Vyanzo vya vitabu vipya' ambavyo unaweza kuviona chini upande wa kushoto wa Nembo ya Mkusanyiko. Haiwezi kufunguliwa ili kuhakikiwa.
en: This collection is part of your 'Sources for new books' which you can see in the bottom left of the Collections tab. It cannot be opened for editing.

source: Mikusanyiko wa Bloom
en: Bloom Collections

source: Tafuta kwa kutumia mtandao mkusanyiko mwingine ulio kwenye kompyuta hii
en: Browse for another collection on this computer

source: Nakili kutoka kwa Chorus Hub kwenye Mfumo wa mtandao wa Eneo
en: Copy From Chorus Hub on Local Network

source: Nakili kutoka kwa Intaneti
en: Copy from Internet

source: Nakili kutoka kwa Kiendesha mtambo cha USB
en: Copy from USB Drive

source: Tengeneza Mkusanyiko Mpya
en: Create New Collection

source: Fungua/Tengeneza Mikusanyiko
en: Open/Create Collections

source: Soma Zaidi
en: Read More

source: Je, kuna yeyote ambaye ametumia Tuma/Pokea kutumia mkusanyiko na wewe?\nTumia mojawapo wa vifute hivi vya rangi nyekundu ili kunakili mkusanyiko wake kwenye kompyuta yako.\nBaadaye, tumia Tuma/Pokea ili kuwatumia tena kazi yako.
en: Has someone else used Send/Receive to share a collection with you?\nUse one of these red buttons to copy their collection to your computer.\nLater, use Send/Receive to share your work back with them.

source: Kurasa haziwezi kupangwa upya unapotafsiri kitabu.
en: Pages can not be re-ordered when you are translating a book.

source: Tafadhali weka Kifaa cha kusoma cha Adobe ili Bloom iweze kuonyesha kitabu chako kilichokamilika. Hadi hapo, bado unaweza kuhifadhi PDF Kitabu na ukifungue kwenye programu nyingine.
en: Please install Adobe Reader so that Bloom can show your completed book. Until then, you can still save the PDF Book and open it in some other program.

source: Hilo sio jambo la kawaida... Kifaa cha kusoma cha Adobe kilionyesha kuwepo kwa hitilafu katika harakati ya kujaribu kuonyesha hiyo PDF. Bado unaweza kujaribu kuhifadhi PDF Kitabu.
en: That's strange... Adobe Reader gave an error when trying to show that PDF. You can still try saving the PDF Book.

source: Ripoti Mbaya. Bloom haikuweza kupata Kifaa cha Adobe cha Kusoma ili kuonyesha hapa, hivyo Bloom haiwezi kukuonyesha kitabu chako kilichokamilika.\nTafadhali toa tafsiri ilioko ya 'Kifaa cha kusoma cha Adobe' na uweke upya 'Kifaa cha kusoma cha Adobe'.\nHadi utakapoweza kufanya hivyo, bado uaweza kuhifadhi PDF Kitabu na kukifungua kwenye programu nyingine.
en: Sad News. Bloom wasn't able to get Adobe Reader to show here, so Bloom can't show your completed book.\nPlease uninstall your existing version of 'Adobe Reader' and (re)install 'Adobe Reader'.\nUntil you get that fixed, you can still save the PDF Book and open it in some other program.

source: Pande za ndani za Vijitabu
en: Booklet Insides

source: Tengeneza kijitabu kutokana na kurasa za ndani za kitabuKurasa zitatolewa na kupangwa upya ili utakapokikunja, utakuwa na kijitabua.\n
en: Make a booklet from the inside pages of the book. Pages will be laid out and reordered so that when you fold it, you'll have a booklet.\n

source: Weka
en: Upload

source: Weka kwa BloomLibrary.org, pale ambapo watu wengine wanaweza kukitoa na kukitafsiri kwa lugha zao wenyewe.
en: Upload to BloomLibrary.org, where others can download and localize into their own language.

source: Ngozi ya Kijitabu
en: Booklet Cover

source: Tengeneza PDF ya mbele tu na nyuma (pande zote), ili uweze kuchapisha kwenye karatasi ya rangi.
en: Make a PDF of just the front and back (both sides), so you can print on colored paper.

source: Tengeneza ePUB (kitabu cha kielektroniki) kutokana na kitabu hiki, ukikiruhusu kuweza kusomwa kwenye vifaa tofauti vya kusoma vya kielektroniki.
en: Make an ePUB (electronic book) out of this book, allowing it to be read on various electronic reading devices.

source: Usionyeshe Hii Tena
en: Don't Show This Again

source: Habari kuhusu Muundo wa Ndani wa XML
en: InDesign XML Information

source: PDF kifaa cha kutazama kinaweza kuboreshwa kwa kuweka kifaa cha kusoma cha Adobe cha bure kwenye kompyuta hii.
en: This PDF viewer can be improved by installing the free Adobe Reader on this computer.

source: Rahisi
en: Simple

source: Tengeneza PDF ya kila ukurasa wa kitabu, ukurasa mmoja kwa kila kipande cha karatasi.
en: Make a PDF of every page of the book, one page per piece of paper.

source: Fungua PDF kifaa cha kutazama kwenye mfumo wa kawaida PDF
en: Open the PDF in the default system PDF viewer

source: Kuchukua nafasi ya yaliyokuwemo
en: Replace Existing

source: Tangazo
en: Notice

source: Bloom ilikuwa na tatizo katika kutengeneza PDF kitabu hiki. Unaweza kuhitaji usaidizi wa kifundi au uwasiliane na wataalamu husika wa Bloom. Lakini hapa ni baadhi ya mambo unayoweza kujaribu:
en: Bloom had a problem making a PDF of this book. You may need technical help or to contact the developers. But here are some things you can try:

source: Jaribu kufanya hivi kwa kompyuta iliyo na nafasi zaidi
en: Try doing this on a computer with more memory

source: Fungua upya kompyuta yako na na ujaribuu hii tena mara moja
en: Restart your computer and try this again right away

source: Weka picha zilizo na uthabiti wa chini kwenye nafasi ya zile zilizo na udhabiti wa juu kwenye chapisho lako
en: Replace large, high-resolution images in your document with lower-resolution ones

source: U&chapishe...
en: &Print...

source: Chapisha
en: Publish

source: &Uhifadhi ...
en: &Save PDF...

source: U&hifadhi ePUB...
en: &Save ePUB...

source: Alama
en: Crop Marks

source: Kukiri
en: Acknowledgments

source: Maombi zaidi:
en: Additional Requests:

source: Haki zote zimehifadhiwa (Wasiliana na anayemiliki haki ili kupata Idhini yoyote.)
en: All rights reserved (Contact the Copyright holder for any permissions.)

source: BloomLibrary.org Tayari ina tafsiri nyingine ya kitabu hiki kutoka kwako.Iwapo utakiweka tena, tafsiri hiyo nafasi yake itachukuliwa na tafsiri yako ya sasa.
en: BloomLibrary.org already has a previous version of this book from you. If you upload it again, it will be replaced with your current version.

source: Haki Miliki
en: Copyright

source: sifa
en: credits

source: Samahani, kulikuwa na tatizo katika kuweka {0}. Baadhi ya maelezo yanafuata. Unaweza kuhitaji usaidizi wa kiufundi.
en: Sorry, there was a problem uploading {0}. Some details follow. You may need technical help.

source: Nyanja moja au zaidi ya zilizoko hapo juu zinahitaji uangalifu wako kabla ya kuweka.
en: One or more fields above need your attention before uploading.

source: Samahani, "" haikufaulu kuwekwa. Wakati mwingine hii husababishwa na matatizo yasiyo ya kudumu yanayotokana na vifaa tunavyotumia. Ni muhimu kujaribu tena kwa muda wa saa moja au mbili. Iwapo utapata tatizo hili mara kwa mara tafadhali piga ripoti kwetu.
en: Sorry, "{0}" was not successfully uploaded. Sometimes this is caused by temporary problems with the servers we use. It's worth trying again in an hour or two. If you regularly get this problem please report it to us.

source: Kwa kuweka, unadhibitisha makubaliano yako na Masharti ya matumizi ya Maktaba ya Bloom na unaipa haki inayostahili.
en: By uploading, you confirm your agreement with the Bloom Library Terms of Use and grant the rights it describes.

source: Kulikuwa na tatizo katika kuweka kitabu chako.
en: There was a problem uploading your book.

source: Matumizi/Leseni
en: Usage/License

source: Akaunti Tayari Ipo
en: Account Already Exists

source: Hatuwezi tukakufungulia akaunti kwa kutumia anwani hiyo, kwa kuwa tayari tuna akaunti inayotumia anwani hiyo. Je, badala yake ungependa kuingia kwenye akaunti yako?
en: We cannot sign you up with that address, because we already have an account with that address. Would you like to log in instead?

source: Bloom haikuweza kuungana na mtandao ili kuthibitisha kuingia kwako. Tafadhali angalia intaneti yako.
en: Bloom could not connect to the server to verify your login. Please check your network connection.

source: Huwezi kuingia
en: Login failed
